Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 20, 70)            20440     
_________________________________________________________________
lstm_1 (LSTM)                (None, 20, 40)            17760     
_________________________________________________________________
lstm_2 (LSTM)                (None, 20, 25)            6600      
_________________________________________________________________
lstm_3 (LSTM)                (None, 15)                2460      
_________________________________________________________________
dense (Dense)                (None, 2)                 32        
=================================================================
Total params: 47,292
Trainable params: 47,292
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 30
Execution time: 3114.37
