Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed (TimeDistri (None, 20, 80)            240       
_________________________________________________________________
time_distributed_1 (TimeDist (None, 20, 20)            1620      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 20, 10)            210       
_________________________________________________________________
flatten (Flatten)            (None, 200)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 402       
=================================================================
Total params: 2,472
Trainable params: 2,472
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 30
Execution time: 593.47
